Revit 2027 API
Mullion Methods
The Mullion type exposes the following members.
Methods
Name | Description
AddCoping | Adds a coping (cut) to a steel beam.
(Inherited from FamilyInstance)
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
BreakMullion |  This method is used to break the current Mullion at ends with its neighboring mullions.
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
Dispose
(Inherited from Element)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
flipFacing | The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.
(Inherited from FamilyInstance)
FlipFromToRoom |  Flips the settings of "From Room" and "To Room" for the door or window instance.
(Inherited from FamilyInstance)
flipHand | The orientation of family instance hand will be flipped. If it can not be flipped, return false, otherwise return true.
(Inherited from FamilyInstance)
GetCopingIds | Lists the elements currently used as coping cutters for this element.
(Inherited from FamilyInstance)
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetFamilyPointPlacementReferences | Returns the Point Placement References for the Family Instance.
(Inherited from FamilyInstance)
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetOriginalGeometry |  Returns the original geometry of the instance, before the instance is modified by joins, cuts, coping, extensions, or other post-processing.
(Inherited from FamilyInstance)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetReferenceByName |  Gets the family instance reference corresponding to the named reference plane in the instance's family.
(Inherited from FamilyInstance)
GetReferenceName |  Gets the name of the reference plane in the family corresponding to the given family instance reference.
(Inherited from FamilyInstance)
GetReferences |  Gets family instance references corresponding to the reference planes or reference lines of the given reference type in the instance's family.
(Inherited from FamilyInstance)
GetReferenceType |  Gets the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference.
(Inherited from FamilyInstance)
GetSpatialElementCalculationPoint | Gets the location of the calculation point for this instance.
(Inherited from FamilyInstance)
GetSpatialElementFromToCalculationPoints | Gets the locations for the calculation points for this instance.
(Inherited from FamilyInstance)
GetSubComponentIds | Gets the sub component ElementIds of the current family instance.
(Inherited from FamilyInstance)
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetSweptProfile | Gets the object that describes the profile that is swept along the driving curve for this instance.
(Inherited from FamilyInstance)
GetTotalTransform |  Gets the total transform, which includes the true north transform for instances like import instances.
(Inherited from Instance)
GetTransform |  Gets the transform of the instance.
(Inherited from Instance)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasModifiedGeometry | Identifies if the geometry of this FamilyInstance has been modified from the automatically generated default.
(Inherited from FamilyInstance)
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
HasSweptProfile | Indicates if this instance can be represented as a swept profile.
(Inherited from FamilyInstance)
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
JoinMullion |  This method is used to control the join condition the current Mullion with its neighboring mullions.
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
RemoveCoping | Removes a coping (cut) from a steel beam.
(Inherited from FamilyInstance)
rotate | The family instance will be flipped by 180 degrees. If it can not be rotated, return false, otherwise return true.
(Inherited from FamilyInstance)
SetCopingIds | Specifies the set of coping cutters on this element.
(Inherited from FamilyInstance)
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
Split | Splits the family instance element at a point on its defining curve.
(Inherited from FamilyInstance)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Mullion Class
Autodesk.Revit.DB Namespace